app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---
  def index
    @recipes = Recipe.where(user_id: current_user.id)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1 LIMIT $2  [["recipe_id", 1], ["LIMIT", 1]]
---
  def show
    @recipe = Recipe.find(params[:id])
    @recipefoods = RecipeFood.includes(:food).where(recipe_id: params[:id])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]
---
  def public
    @recipes = Recipe.includes(:recipe_foods, :user).where(public: true)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "updated_at" = $1, "public" = $2 WHERE "recipes"."id" = $3  [["updated_at", "2023-02-07 18:28:35.070458"], ["public", false], ["id", 1]]
---
  def toggle
    @recipe = Recipe.find(params[:id])
    @recipe.toggle! :public

INSERT INTO "recipes" ("created_at", "updated_at", "name", "preparation_time", "cooking_time", "description", "public", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipe = Recipe.new(params.require(:recipe).permit(:name, :preparation_time, :cooking_time, :description, :public))
    @recipe.user = current_user
    if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy