app/models/recipe.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
---
  def total_price
    recipefoods = RecipeFood.includes(:food).where(recipe_id: id)
    total = 0
    recipefoods.each do |item|

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
---
  def total_items
    recipefoods = RecipeFood.where(recipe_id: id)
    recipefoods.length